#include <iostream>
#include <stdlib.h>
#include <ctime>
using namespace std;

int main (){
	
//	Да се направи игра на морски шах като дъската ще представлява двумерен масив(3Х3). 
//	Нека на случаен принцип се избере дали пърово ще започва играч Х или играч 0. 
//	Отново на случаен принцп всеки да изпълни хода си до запълването надъската. 
//	На всеки ход и да се извежда кой играч е наред и визуализира на дъската (масива3х3). 
//	Не се изисква да се следи или да се проверява дали някой е спечелил прорамата се изпълнява докато се запълни дъската(масива3х3).
	srand(time(NULL));
	char board [3][3];
	
	char p1, p2 ;
	if (rand()%2==0){
		p1 = 'x';
		p2 = 'o';
		}else{
			p1 = 'o';
			p2 = 'x';
			}
	cout<< "player 1 is " << p1 << endl;
	
	for(int turn = 1; turn < 10; turn++){
		for(int i = 0; i<3; i++){
			for(int j = 0; j<3; j++){
				cout<< board[i][j]<<" ";
				}
				cout<<endl;
			}
		}
	
	
	
	cout << "Hello world" << endl;
	return 0;
	}