#include <iostream>
using namespace std;

int main() {
    cout << "Please choose option:\n1. По зададено цяло число от клавитурата да се изведе на екрана неговия модул.\n2. По зададено дробно число от клавитурата да се изведе на екрана само неговата дробна част.\n3. По зададена дробно число от клавитурата да се изведе на екрана само неговата цяла част.\n4. По зададена буква от клавитурата да се изведе на екрана дали буквата е малка или голяма.\n5. По зададена буква от клавитурата да се изведе на екрана коя подред е съответната буква в азуката(Пример a e 1; c e 3; j e 10 и т.н.) Програмата трябва да работи както с малки така и с големи букви.\n6. Да се намери сборът на четните цифри на дадено цяло число. Числото се вкарва от клавиатурата.\n7. Да се намери произедението на нечетните цифри на дадено цяло число. Числото се вкарва от клавиатурата.\n8. Да се изкара на екрана таблицата за умножение от 1 до 10.\n9. Дадени са две променливи а и b. Разменете техните стойности, а да вземе стойността на b и обратно.\n10. Да се изведе сбора на цифрите на всички двицифрени числа в зададен диапазон от такива (диапазона се въвежда от клавиатурата)" << endl;
    int choice {0};
    do{
        cin >> choice;
        switch (choice){
            case 1: {
                //1. По зададено цяло число от клавитурата да се изведе на екрана неговия модул.
                cout << "1. Please enter a whole number" << endl;
                int a {0};
                cin >> a;
                if(a<0){
                    cout << "the modulus of " << a << " is "<< -a << endl; 
                }else{
                     cout << "the modulus of "<< a << " is " << a << endl;}
            }
            case 2: {
                //2. По зададено дробно число от клавитурата да се изведе на екрана само неговата дробна част.
                 cout << "2. Please enter a fractional number" << endl;
                 double b {0};
                 cin >> b ;
                 if ( b>1 || b<-1 ){
                     int b1 = b;
                     b-=b1;}
                 cout << "the fractional part of the number is: " << b << endl;
            }
            case 3: {
                //3. По зададена дробно число от клавитурата да се изведе на екрана само неговата цяла част.*/
                cout << "3. Please enter a fractional number" << endl;
                double c {0};
                cin >> c ;
                int c1 = c;
                cout << "the whole part of the number is: " << c1 << endl;
            }
            case 4: {
                //4. По зададена буква от клавитурата да се изведе на екрана дали буквата е малка или голяма.
                cout << "4. Please eneter a character" << endl;
                char d;
                cin >> d;
                if(d>='A' && d<='Z'){
                    cout<< "the character "<<d<<" is CAPITAL!"<< endl;
                }else if (d>='a' && d<= 'z'){
                    cout <<"The character "<<d<<" is lower case."<<endl;}
            }
            case 5: {
                //5. По зададена буква от клавитурата да се изведе на екрана коя подред е съответната буква в азуката
                //Пример: a e 1; c e 3; j e 10 и т.н. 
                //Програмата трябва да работи както с малки така и с големи букви.
                char e;
                cout << "Please enter a character: ";
                cin >> e;
                cout<< endl;
                if (e >= 'a' && e <= 'z'){
                    int e1 = e;
                    if(e == 'a'){
                        cout << "The letter "<< e << " is the "<< e1-96 <<"st letter in the aphabet" << endl;
                        }else if (e == 'b'){
                            cout << "The letter "<< e << " is the "<< e1-96 <<"nd letter in the aphabet" << endl;
                        }else if (e =='c'){
                            cout << "The letter "<< e << " is the "<< e1-96 <<"rd letter in the aphabet" << endl;
                        }else{
                            cout << "The letter "<< e << " is the "<< e1-96 <<"th letter in the aphabet" << endl; 
                        }
                    }else if (e >='A' && e <='Z'){
                    int e1 = e;
                    cout << "The letter "<< e << " is the "<< e1-64 <<"th letter in the aphabet" << endl;}
            }
            case 6: {
                //6. Да се намери сборът на четните цифри на дадено цяло число. Числото се вкарва от клавиатурата.
                int f {0};
                cout << "Please enter a whole number: ";
                cin >> f;
                cout << endl;
                 


//                
//                while (f > 1){
//                    int f1 {0};
//                    if ((f%10)%2!=0){
//                        }
//                    }
            }
            
    /*
    7. Да се намери произедението на нечетните цифри на дадено цяло число. Числото се вкарва от клавиатурата.
    8. Да се изкара на екрана таблицата за умножение от 1 до 10.
    9. Дадени са две променливи а и b. Разменете техните стойности, а да вземе стойността на b и обратно.
    10. Да се изведе сбора на цифрите на всички двицифрени числа в зададен диапазон от такива (диапазона се въвежда от клавиатурата),
    */
        
            default: break;
    }
        }while(true);
    return 0;
}